#include <stdio.h>

/*整理总结C语言中二维数组的基本用法*/

/*
1.C语言中二维数组在内存中是按行存放的，即先存放第一行元素，再存放第二行元素
2.C语言中允许使用多维数组，如三维数组：int a[3][4][5]
3.和一维数组一样，二维数组的下标都是从0开始计算，定义int a[3][4]数组不存在a[3][4]元素
*/


int main()
{
    void test_init();
    test_init();

    return 0;
}


void test_init()
{
    int i, j;
    int a[3][4] = {{1, 2, 3, 4}, {5, 6, 7, 8}, {9, 10, 11, 12}}; /*定义一个三行四列的整型二维数组*/
    //int b[3][4] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12}; /*可以将所有数值写在一个括号内，但要按顺序排列好*/
    //int c[3][4] = {{1}, {5}, {9}}; /*对每行第一个元素赋值，其他未指定元素默认值为0*/
    //int d[3][4] = {{1, 2}, {5, 6}, {0, 0, 11}}; /*可以对部分元素赋值，其他未指定元素默认值为0*/
    //int e[3][4] = {{1, 2}, {5, 6}}; /*可以只对几行元素赋值，其他未指定元素默认值为0*/
    //int f[][4] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12}; /*如果指定了全部值，定义时可以省略行数，但不能省略列数*/


    for(i = 0; i <= 2; i++)
    {
        for(j = 0; j <= 3; j++)
            printf("%d,", a[i][j]);
        printf("\n");
    }
        
}


