#include <stdio.h>

/*C语言中用指针指向二维数组*/

/*
1.和一维数组一样，二维数组名代表首行(第0行)的首个元素地址，即p = &a[0][0]; 等价于 p = a;
2.a + i代表第i行的首个元素地址，例如：a + 2 = &a[2][0]
3.a[i]代表第i行的一维数组的名字，因此也等于第i行首个元素的地址，a[2] = &a[2][0]
4.a[i] == a + i == *(a + i) == &a[i] == &a[i][0]，这几个写法等价，都表示第i行首个元素的地址 
5.第0行第1列元素a[0][1]的地址可以表示为a[0] + 1，即 *(a[0] + 1) = a[0][1]或a[0] + 1 = &a[0][1]
6.待补充.....
*/


int main()
/*实际测试发现：第二行的元素也可以用*(a[0] + i)表示出来*/
{
    int a[2][3] = {{1, 2, 3}, {4, 5, 6}};
    int * p;
    p = a;
    for (int i = 0; i < 6; i ++)
    {
        /*用数组名要有[0]，用指针不能有[0]*/
        printf("%d, %d\n", *(p + i), *(a[0] + i));
    }

    return 0;
}
